#include <stdio.h>
#include <locale.h>
#include <conio.h>
int main()
{
	setlocale(LC_ALL, "Russian");
	int m, d;
	int day[31] = { "первое ","второе ","третье ","четвертое ","пятое ","шестое ","седьмое ","восьмое ","девятое ",
		"десятое ","одинадцатое ","двенадцатое ","тринадцатое ","четырнадцатое ","пятнадцатое ","шестнадцатое ","семнадцатое ","восемнадцатое ",
		"девятнадцатое ","двадцатое ","двадцать первое ","двадцать второе ","двадцать третье ","двадцать четвертое ","двадцать пятое ","двадцать шестое ",
		"двадцать седьмое ","двадцать восьмое ","двадцать девятое ","тридцатое ","тридцать первое " };
	int mounth[12] = { "января","февраля","марта","апреля","мая","июня","июля","августа","сентября","октября","ноября","декабря" };
	printf("Введите день (1-31) и месяц (1-12): ");
	scanf("%d %d", &d, &m);
	int s;
	for (s = 0; s < 1; s++)
	{
		printf(day[d - 1]);
		printf(mounth[m - 1]);
	}
		

}